import Heder from '../../components/heder/Heder'
import styles from './login.module.css'
import { useTranslation } from 'react-i18next'
function Login() {
  const {t,i18n}=useTranslation()
  return (
    <div>
       <Heder></Heder>
       <main>
        <div className={styles.container}>
          <h1>{t("textH2")}</h1>
          <div className={styles.lib}>
          <img src="11.png" alt="dfv" />
          <div className={styles.text}>
              <h2>Кіт, ти маму мав</h2>
              <p>У центрі міста з’явився загадковий кіт, що викликає більше запитань, ніж відповідей. Чорно-білий, із розумним поглядом і медальйоном на шиї, він щодня приходить до кав’ярні на розі вулиці Шевченка й уважно слухає відвідувачів.
Але найбільше здивування викликала фраза, яку, за словами очевидців, він нібито "вимуркав" минулого вечора: «Мяу... ти маму мав?» – свідчить бариста Оля, яка вже третій день приносить котові миску з водою і трохи тунця.
Місцеві жителі гадають, що кіт шукає когось із минулого. Хтось навіть припускає, що він — реінкарнація якогось філософа, що повернувся на землю з місією нагадати про сімейні цінності.
Хто ця істота з глибокими очима та трагічним поглядом? І головне – де його мама?
Розслідування триває.</p>
          </div>
          </div>
          <section>
             <div className={styles.ota}>
                          <div className={styles.card1}>
                            <h3>Кіт, ти маму мав</h3>
                            <img src="7.png" alt="sd" />
                            <p>02.02.2024 <br />Студенти групи ПЗ-12 вирішили створити новий сайт для кафедри програмного забезпечення.</p>
                            <h5>Дізнатися більше</h5>
                          </div>
                          <div className={styles.card1}>
                            <h3>Кіт Васьок гадає на картах Таро</h3>
                            <img src="8.png" alt="sd" />
                            <p>30 листопада, 2023 <br />Студенти групи ПЗ-12 вирішили створити новий сайт для кафедри програмного забезпечення.</p>
                            <h5>Дізнатися більше</h5>
                          </div>
                          <div className={styles.card1}>
                            <h3>Виставка людей. Запрошуємо </h3>
                            <img src="9.png" alt="sd" />
                            <p>2 лютого, 2024 <br />Студенти групи ПЗ-12 вирішили створити новий сайт для кафедри програмного забезпечення.</p>
                            <h5>Дізнатися більше</h5>
                          </div>
                        </div>
          </section>




        </div>
       </main>
    </div>
  )
}

export default Login